conditional-auth-sample/src/main/resources/common/configs/sso-config.xml

<!--
 Copyright (c) 2018, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd"
                  xmlns:xsd1="http://dto.saml.sso.identity.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <xsd:addRPServiceProvider>
            <!--Optional:-->
            <xsd:spDto>
                <!--Zero or more repetitions:-->
                <xsd1:assertionConsumerUrls>${ACS}</xsd1:assertionConsumerUrls>
                <!--Optional:-->
                <xsd1:assertionQueryRequestProfileEnabled>false</xsd1:assertionQueryRequestProfileEnabled>
                <!--Optional:-->
                <xsd1:attributeConsumingServiceIndex>1223160755</xsd1:attributeConsumingServiceIndex>
                <!--Optional:-->
                <xsd1:certAlias>wso2carbon</xsd1:certAlias>
                <!--Optional:-->
                <xsd1:defaultAssertionConsumerUrl>${ACS}</xsd1:defaultAssertionConsumerUrl>
                <!--Optional:-->
                <xsd1:digestAlgorithmURI>http://www.w3.org/2000/09/xmldsig#sha1</xsd1:digestAlgorithmURI>
                <!--Optional:-->
                <xsd1:doEnableEncryptedAssertion>false</xsd1:doEnableEncryptedAssertion>
                <!--Optional:-->
                <xsd1:doSignAssertions>true</xsd1:doSignAssertions>
                <!--Optional:-->
                <xsd1:doSignResponse>true</xsd1:doSignResponse>
                <!--Optional:-->
                <xsd1:doSingleLogout>true</xsd1:doSingleLogout>
                <!--Optional:-->
                <xsd1:doValidateSignatureInRequests>false</xsd1:doValidateSignatureInRequests>
                <!--Optional:-->
                <xsd1:enableAttributeProfile>false</xsd1:enableAttributeProfile>
                <!--Optional:-->
                <xsd1:enableAttributesByDefault>false</xsd1:enableAttributesByDefault>
                <!--Optional:-->
                <xsd1:idPInitSLOEnabled>true</xsd1:idPInitSLOEnabled>
                <!--Optional:-->
                <xsd1:idPInitSSOEnabled>true</xsd1:idPInitSSOEnabled>
                <!--Zero or more repetitions:-->
                <xsd1:idpInitSLOReturnToURLs>${ACS}</xsd1:idpInitSLOReturnToURLs>
                <!--Optional:-->
                <xsd1:issuer>${ISSUER}</xsd1:issuer>
                <!--Optional:-->
                <xsd1:nameIDFormat>urn/oasis/names/tc/SAML/1.1/nameid-format/emailAddress</xsd1:nameIDFormat>
                <!--Zero or more repetitions:-->
                <xsd1:requestedAudiences>https://localhost:9443/oauth2/token</xsd1:requestedAudiences>
                <!--Zero or more repetitions:-->
                <xsd1:requestedRecipients>https://localhost:9443/oauth2/token</xsd1:requestedRecipients>
                <!--Optional:-->
                <xsd1:signingAlgorithmURI>http://www.w3.org/2000/09/xmldsig#rsa-sha1</xsd1:signingAlgorithmURI>
                <!--Optional:-->
                <xsd1:sloRequestURL></xsd1:sloRequestURL>
                <!--Optional:-->
                <xsd1:sloResponseURL></xsd1:sloResponseURL>
            </xsd:spDto>
        </xsd:addRPServiceProvider>
    </soapenv:Body>
</soapenv:Envelope>
